# Subsetting and Descriptive Stats

## Before your start:
   - Remember that you just need to do one of the challenges.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in IronHack's database.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly: enjoy the process!
   
#### Import all the necessary libraries here:

In [1]:
# import libraries here
import pandas as pd
import seaborn as sns

# [ONLY ONE MANDATORY] Challenge 1
#### In this challenge we will use the `Temp_States`  dataset. 

#### First import it into a dataframe called `temp`.

In [24]:
# your code here
temp = pd.read_csv("Temp_States.csv")

#### Print `temp`.

In [25]:
# your code here
temp

         City        State  Temperature
0         NYC     New York    19.444444
1      Albany     New York     9.444444
2     Buffalo     New York     3.333333
3    Hartford  Connecticut    17.222222
4  Bridgeport  Connecticut    14.444444
5      Treton   New Jersey    22.222222
6      Newark   New Jersey    20.000000

#### Explore the data types of the *temp* dataframe. What types of data do we have? Comment your result.

In [39]:
# your code here
temp.info()
temp.dtypes

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
City           7 non-null object
State          7 non-null object
Temperature    7 non-null float64
dtypes: float64(1), object(2)
memory usage: 296.0+ bytes

City            object
State           object
Temperature    float64
dtype: object

In [ ]:
"""
your comments here
we have two object which mean string and a flaot number from which we can work with
"""

#### Select the rows where state is New York.

In [29]:
# your code here
temp_NY = temp[temp['State'] == "New York"]
temp_NY

      City     State  Temperature
0      NYC  New York    19.444444
1   Albany  New York     9.444444
2  Buffalo  New York     3.333333

#### What is the average temperature of cities in New York?

In [30]:
# your code here
temp_NY[['Temperature']].mean(axis = 0)

Temperature    10.740741
dtype: float64

#### Which states and cities have a temperature above 15 degrees Celsius?

In [32]:
# your code here
temp_15= temp[(temp['Temperature'] > 15)]
temp_15["City"].unique()

array(['NYC', 'Hartford', 'Treton', 'Newark'], dtype=object)

#### Now, return only the cities that have a temperature above 15 degrees Celsius.

In [33]:
# your code here
temp_15["State"].unique()

array(['New York', 'Connecticut', 'New Jersey'], dtype=object)

#### Which cities have a temperature above 15 degrees Celcius and below 20 degrees Celsius?

**Hint**: First, write the condition. Then, select the rows.

In [35]:
# your code here
temp_15_20 = temp[(temp['Temperature'] > 15) & (temp['Temperature'] <20)]
temp_15_20

       City        State  Temperature
0       NYC     New York    19.444444
3  Hartford  Connecticut    17.222222

#### Find the mean and standard deviation of the temperature of each state.

In [40]:
# your code here
temp.groupby(["State"])["Temperature"].agg(["mean", "std"])

                  mean       std
State
Connecticut  15.833333  1.964186
New Jersey   21.111111  1.571348
New York     10.740741  8.133404

# [ONLY ONE MANDATORY]  Challenge 2

#### Load the `employees` dataset into a dataframe. Call the dataframe `employees`.

In [45]:
# your code here
employee = pd.read_csv("Employee.csv")

#### Explore the data types of the `employees` dataframe. Comment your results.

In [46]:
# your code here
employee

     Name Department Education Gender      Title  Years  Salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
6  Carlos         IT    Master      M         VP      8      70
7   Pedro         IT       Phd      M  associate      7      60
8     Ana         HR    Master      F         VP      8      70

In [ ]:
"""
your comments here
"""

#### What's the average salary in this company?

In [47]:
# your code here
employee[['Salary']].mean(axis = 0)

Salary    48.888889
dtype: float64

#### What's the highest salary?

In [48]:
# your code here
employee[['Salary']].max(axis = 0)

Salary    70
dtype: int64

#### What's the lowest salary?

In [49]:
# your code here
employee[['Salary']].min(axis = 0)

Salary    30
dtype: int64

#### Who are the employees with the lowest salary?

In [51]:
# your code here
employee_low= employee[(employee['Salary'] == 30)]
employee_low

    Name Department Education Gender    Title  Years  Salary
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

#### Find all the information about an employee called David.

In [57]:
# your code here
david = employee[(employee['Name'] == "David")]
david

    Name Department Education Gender    Title  Years  Salary
2  David         HR    Master      M  analyst      2      30

#### Could you return only David's salary?

In [ ]:
# your code here

#### Print all the rows where job title is associate.

In [59]:
# your code here
associate = employee[(employee['Title'] == "associate")]
associate

     Name Department Education Gender      Title  Years  Salary
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
7   Pedro         IT       Phd      M  associate      7      60

#### Print the first 3 rows of your dataframe.
**Tip**: There are 2 ways to do it. Do it both ways.

In [60]:
# Method 1
# your code here
employee.head(3)

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

In [ ]:
# Method 2
# your code here

#### Find the employees whose title is associate and whose salary is above 55.

In [62]:
# your code here
associate_55 = employee[(employee['Title'] == "associate")& (employee['Salary'] > 55)]
associate_55

    Name Department Education Gender      Title  Years  Salary
7  Pedro         IT       Phd      M  associate      7      60

#### Group the employees by number of years of employment. What are the average salaries in each group?

In [65]:
# your code here
year = employee.groupby(["Years"])["Salary"].agg(["mean"])
year

            mean
Years
1      35.000000
2      38.333333
3      55.000000
4      35.000000
7      60.000000
8      70.000000

####  What is the average salary per title?

In [67]:
# your code here
title = employee.groupby(["Title"])["Salary"].agg(["mean"])
title

                mean
Title
VP         70.000000
analyst    32.500000
associate  56.666667

####  Find the salary quartiles.

In [75]:
# your code here
employee[['Salary']].quantile(0.25, axis = 0)
employee[['Salary']].quantile(0.75, axis = 0)

Salary    60.0
Name: 0.75, dtype: float64

#### Is the mean salary different per gender?

In [69]:
# your code here
gender = employee.groupby(["Gender"])["Salary"].agg(["mean"])
gender

        mean
Gender
F       47.5
M       50.0

#### Find the minimum, mean and maximum of all numeric columns for each company department.

In [78]:
# your code here
employee.mean()
employee.max()

Name              Sonia
Department        Sales
Education           Phd
Gender                M
Title         associate
Years                 8
Salary               70
dtype: object

#### Bonus Question:  for each department, compute the difference between the maximum and the minimum salary.
**Hint**: try using `agg` or `apply` combined with `lambda` functions.

In [ ]:
# your code here

# [ONLY ONE MANDATORY] Challenge 3
#### Open the `Orders` dataset. Name your dataset `orders`.

In [ ]:
# your code here

#### Explore your dataset by looking at the data types and summary statistics. Comment your results.

In [ ]:
# your code here

In [ ]:
"""
your comments here
"""

####  What is the average purchase price?

In [ ]:
# your code here

#### What are the highest and lowest purchase prices?

In [ ]:
# your code here

#### Select all the customers from Spain.
**Hint**: Remember that you are not asked to find orders from Spain but customers. A customer might have more than one order associated.

In [ ]:
# your code here

#### How many customers do we have in Spain?

In [ ]:
# your code here

#### Select all the customers who have bought more than 50 items.
**Hint**: Remember that you are not asked to find orders with more than 50 items but customers who bought more than 50 items. A customer with two orders of 30 items each should appear in the selection.

In [ ]:
# your code here

#### Select orders from Spain that include more than 50 items.

In [ ]:
# your code here

#### Select all free orders.

In [ ]:
# your code here

#### Select all orders whose description starts with `lunch bag`.
**Hint**: use string functions.

In [ ]:
# your code here

#### Select all `lunch bag` orders made in 2011.

In [ ]:
# your code here

#### Show the frequency distribution of the amount spent in Spain.

In [ ]:
# your code here

#### Select all orders made in the month of August.

In [ ]:
# your code here

#### Find the number of orders made by each country in the month of August.
**Hint**: Use value_counts().

In [ ]:
# your code here

#### What's the  average amount of money spent by country?

In [ ]:
# your code here

#### What's the most expensive item?

In [ ]:
# your code here

#### What is the average amount spent per year?

In [ ]:
# your code here